#include <iostream>
#include <conio.h>
#include <windows.h>

using namespace std;

bool GameOver; // Переменная, отвечающая за проигрыш
bool GameWin;  // Переменная, отвечающая за выигрыш

const int x = 23;
const int y = 27;
int mas[y][x] = {     {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},   // наш двумерный массив, который отвечает за лабиринт 
					  {3,2,2,2,2,2,2,1,2,1,2,2,2,1,2,1,2,2,2,2,2,2,1},
					  {1,0,0,0,0,1,2,1,2,1,2,1,2,1,2,1,0,0,0,2,1,2,1},
					  {1,2,2,2,2,1,2,2,2,1,2,1,2,1,2,2,2,2,2,2,1,2,1},
					  {1,2,1,0,2,1,2,1,2,1,2,1,2,1,2,1,0,0,0,0,1,2,1},
					  {1,2,1,2,2,1,2,1,2,1,2,1,2,1,2,1,2,2,2,2,1,2,1},
					  {1,2,1,0,0,1,2,1,0,1,2,1,2,1,2,1,2,0,1,2,1,2,1},
					  {1,2,2,2,2,2,2,2,2,2,2,1,2,2,2,1,2,2,1,2,1,2,1},
					  {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,2,1,2,1},
					  {1,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1},
					  {1,2,0,1,0,0,2,1,0,0,0,1,2,1,0,0,1,0,0,0,0,2,1},
					  {1,2,2,1,2,2,2,1,2,2,2,1,2,1,2,2,1,2,2,2,2,2,1},
					  {1,0,2,1,2,0,0,1,2,1,2,1,2,1,2,0,0,2,1,2,0,0,1},
					  {1,2,2,1,2,2,2,1,2,1,2,2,2,1,2,1,2,2,1,2,2,2,1},
					  {1,0,0,1,0,0,0,1,2,1,0,0,0,1,2,1,2,0,0,0,0,2,1},
					  {1,2,2,1,2,2,2,1,2,1,2,2,2,1,2,1,2,2,2,1,2,2,1},
					  {1,2,0,1,2,1,2,2,2,1,2,1,2,1,2,1,0,1,2,1,0,0,1},
					  {1,2,2,1,2,1,0,0,0,1,2,1,2,1,2,2,2,1,2,2,2,2,1},
					  {1,0,2,2,2,1,2,2,2,2,2,1,2,1,0,0,2,1,0,0,0,2,1},
					  {1,0,0,1,2,2,2,1,0,0,0,1,2,2,2,1,2,2,2,2,2,2,1},
					  {1,2,2,2,2,1,0,1,2,2,2,1,0,1,2,1,0,0,0,0,0,0,1},
					  {1,2,1,1,2,1,2,2,2,1,2,2,2,1,2,1,2,2,2,2,2,2,1},
					  {1,2,1,2,2,1,2,1,0,1,0,1,2,2,2,2,2,1,0,0,1,2,1},
					  {1,2,1,2,1,1,2,2,2,2,2,1,0,1,2,1,0,2,2,2,1,2,1},
					  {1,2,1,2,1,2,1,0,0,1,2,1,2,1,2,1,0,2,1,2,1,0,1},
					  {1,2,1,2,2,2,1,2,2,2,2,2,2,1,2,2,2,2,1,2,2,2,5},
					  {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1}
};

void gotoxy(int x, int y)   // процедура перемещения курсора по координатам
{
	static HANDLE h = NULL;
	if (!h)
		h = GetStdHandle(STD_OUTPUT_HANDLE);
	COORD c = { x, y };
	SetConsoleCursorPosition(h, c);
}

void Setup()
{
	GameOver = false;
	GameWin = false;
	system("cls");
		for (int i = 0; i < y; i++)    // выводим наш лабиринт в консоль
		{
			for (int j = 0; j < x; j++)
			{
				if (mas[i][j] == 1) // если значение массива =1, выводим |
					cout << "|";
				else if (mas[i][j] == 0) // Если значение массива =0, выводим O
					cout << "O";
				else if (mas[i][j] == 2) // Если значение массива равно 2, выводим пробел
					cout << " ";
				else if (mas[i][j] == 3) // Если значение массива =3, выводим #
					cout << "#";
			}
			cout << endl;
		}
}

void Draw()
{
	char Keys;
	int poz_x, poz_y;
	poz_x = 30;
	poz_y = 4;
	gotoxy(poz_x, poz_y);                      // Перемещаемся по координатам и выводим строку
	cout << "Передвижение - W,A,S,D.";
	poz_x = 30;
	poz_y = 5;
	gotoxy(poz_x, poz_y);
	cout << "# - ваш пройденный путь.";
	poz_x = 30;
	poz_y = 6;
	gotoxy(poz_x, poz_y);
	cout << "O и | - стены лабиринта.";
	poz_x = 30;
	poz_y = 7;
	gotoxy(poz_x, poz_y);
	cout << "Ходить в обратном направлении запрещено!";
	poz_x = 23;
	poz_y = 25;
	gotoxy(poz_x, poz_y);
	cout << "Выход";
	poz_x = 0;
	poz_y = 1;
	gotoxy(poz_x, poz_y);
	while (!GameOver) // пока игра не проиграна, считываем нажатые кнопки, если для кнопки описан алгоритм действий, то выполняем их (передвижение)
	{
		Keys = _getch();
		if ((Keys == 'd') || (Keys=='D') || (Keys=='в') || (Keys=='В')) // перемещение вправо
		{
			poz_x += 1;
			gotoxy(poz_x, poz_y);
			if (mas[poz_y][poz_x] == 5) // если значение массива 5, то присваиваем GameWin - true
			{
				cout << "#";
				GameWin = true;
			}
			if ((mas[poz_y][poz_x] == 1) || (mas[poz_y][poz_x] == 0) || (mas[poz_y][poz_x] == 3) || (mas[poz_y][poz_x] == 4)) GameOver = true; // если значение массива =1, =0, =3 или =4, то присваиваем GameOver - true
			if (mas[poz_y][poz_x] == 2) // если значение массива =2, то выводим # и присваиваем новое значение =4
			{
				cout << "#";
				mas[poz_y][poz_x] = 4;
			}
			
		}
		if ((Keys == 'w') || (Keys == 'W') || (Keys == 'ц') || (Keys == 'Ц')) // передвижение вверх
		{
			poz_y -= 1;
			gotoxy(poz_x, poz_y);
			if ((mas[poz_y][poz_x] == 1) || (mas[poz_y][poz_x] == 0) || (mas[poz_y][poz_x] == 3) || (mas[poz_y][poz_x] == 4)) GameOver = true;
			if (mas[poz_y][poz_x] == 2)
			{
				cout << "#";
				mas[poz_y][poz_x] = 4;
			}
		}
		if ((Keys == 's') || (Keys == 'S') || (Keys == 'ы') || (Keys == 'Ы')) // передвижение вниз
		{
			poz_y += 1;
			gotoxy(poz_x, poz_y);
			if ((mas[poz_y][poz_x] == 1) || (mas[poz_y][poz_x] == 0) || (mas[poz_y][poz_x] == 3) || (mas[poz_y][poz_x] == 4)) GameOver = true;
			if (mas[poz_y][poz_x] == 2)
			{
				cout << "#";
				mas[poz_y][poz_x] = 4;
			}
		}
		if ((Keys == 'a') || (Keys == 'A') || (Keys == 'ф') || (Keys == 'Ф')) // передвижение влево
		{
			poz_x -= 1;
			gotoxy(poz_x, poz_y);
			if ((mas[poz_y][poz_x] == 1) || (mas[poz_y][poz_x] == 0) || (mas[poz_y][poz_x] == 3) || (mas[poz_y][poz_x]==4)) GameOver = true;
			if (mas[poz_y][poz_x] == 2)
			{
				cout << "#";
				mas[poz_y][poz_x] = 4;
			}
		}
		if (Keys == 'z') // горячая клавиша для того, чтобы сдаться
		{
			GameOver = true;
		}
	}
}

int main()
{        
	SetConsoleCP(1251);               // для восприятия русского языка программой
	SetConsoleOutputCP(1251);        
	Setup();                        // устанавливаем наши стартовые параметры и рисуем поле
	while (!GameOver)  // пока игра не проиграна, выполняем процедуру Draw
	{
		Draw();
	}
	if (GameOver) // если игра проиграна, очищаем поле и выводим строку
	{
		system("cls");
		cout << "Вы проиграли, потому что столкнулись со стеной или сделали ход в обратном направлении." << endl;
	}
	if (GameWin) // если игра выиграна, очищаем поле и выводим строку
	{
		system("cls");
		cout << "Вы прошли лабиринт!" << endl;
	}
	return 0;
}